{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-so_ky_hieu",
    "2": "I-so_ky_hieu",
    "3": "B-ngay_ban_hanh",
    "4": "I-ngay_ban_hanh",
    "5": "B-trich_yeu",
    "6": "I-trich_yeu",
    "7": "B-co_quan_ban_hanh",
    "8": "I-co_quan_ban_hanh",
    "9": "B-noi_gui",
    "10": "I-noi_gui",
    "11": "B-noi_nhan",
    "12": "I-noi_nhan",
    "13": "B-loai_van_ban",
    "14": "I-loai_van_ban"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-co_quan_ban_hanh": 7,
    "B-loai_van_ban": 13,
    "B-ngay_ban_hanh": 3,
    "B-noi_gui": 9,
    "B-noi_nhan": 11,
    "B-so_ky_hieu": 1,
    "B-trich_yeu": 5,
    "I-co_quan_ban_hanh": 8,
    "I-loai_van_ban": 14,
    "I-ngay_ban_hanh": 4,
    "I-noi_gui": 10,
    "I-noi_nhan": 12,
    "I-so_ky_hieu": 2,
    "I-trich_yeu": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "5.9.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "visual_embed": true,
  "vocab_size": 50265
}
